Revit 2027 API
PlumbingUtils.ConnectPipePlaceholdersAtTee Method
Overload List
Name | Description
ConnectPipePlaceholdersAtTee(Document, ElementId, ElementId) |  Connects two placeholders that looks like Tee connection.
ConnectPipePlaceholdersAtTee(Document, Connector, Connector, Connector) |  Connects three placeholders that looks like Tee connection.
Top
See Also
Reference
PlumbingUtils Class
Autodesk.Revit.DB.Plumbing Namespace